[{"content":"Build a Documentation Website with Hugo and GitHub Pages Introduction Hugo is one of the most popular open-source static site generators. With its amazing speed and flexibility, Hugo makes building websites fun again.\nPrerequisites  You have a GitHub account. You have created a repository username**.github.io** in your GitHub account. In this document, 334669098.github.io is used as an example. Your GitHub Pages site is currently being built from the master branch. Learn more.  Procedure Step 1: Install Hugo   Download Hugo. In this document, Hugo for Windows 64-bit is used as an example. For other releases, see https://github.com/gohugoio/hugo/releases.\n  Unzip the downloaded package to any path and add the path to the environment variable Path.\n  Check the Hugo version. If the version number is displayed, the installation is complete.\nhugo -version   Step 2: Create a New Site   Create a site directory. In this document, D:\\Hugo\\Sites is used as an example.\n  Create a site in D:\\Hugo\\Sites.\nhugo new site hugodemohgz # `hugodemohgz` is an example site name.   Step 3: Add a Theme   In the hugodemohgz directory, download the theme Techdoc.\n`git clone https://github.com/thingsym/hugo-theme-techdoc.git /themes/techdoc ` #`https://github.com/thingsym/hugo-theme-techdoc.git` is the URL of the theme in GitHub, and `/themes/techdoc` is the local directory of the downloaded theme. See https://themes.gohugo.io for more themes.\n  Open the config.toml file, add a line theme = \u0026amp;quot;techdoc\u0026amp;quot; at the end, save and exit.\n  Step 4: Add Some Content   Create an index document _index.md in the hugodemohgz\\content directory.\nhugo new _index.md   Edit _index.md, add content and save.\n  Step 5: Publish to GitHub Pages   Build the site in the hugodemohgz\\public directory.\nhugo   Go to the hugodemohgz/public/ directory and initialize the Git repository.\ncd ~/hugodemohgz/public/ # Generated HTML files are stored in the `public` folder, which will be converted to a Git repository. git …","date":-62135596800,"description":"","objectID":"3976528693a0108357f4928017600865","permalink":"https://334669098.github.io/","title":""}]